cf/Documents/РасчетСебестоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>РасчетСебестоимости</Name>
			<BasedOn>
				<xr:Item>Document.Инвойс</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ОплатыИмпорт</xr:Item>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
				<xr:Item>InformationRegister.ТаможенныеЦены</xr:Item>
				<xr:Item>InformationRegister.РасчетСебестоимости</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбщийРасходТранспортировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомиссияЗаОплату</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомиссияЗаДоставку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦенЗакупочный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Инвойс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКурсОплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураДляТаможни</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураДляТаможни</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупочная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесНетто</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесБрутто</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТаможенныйПлатеж</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентТаможенногоПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПоРиску</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пошлина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммарныйПлатеж</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Себестоимость</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупочная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Удорожание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаркетинговаяСебестоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Себестоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТаможенныйПлатеж</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТаможеннаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаркетинговаяСебестоимостьУЕ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Documents/РасчетСебестоимости/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщийРасходТранспортировки = ВладелецФормы.Объект.ОбщийРасходТранспортировки;
	КомиссияЗаДоставку	= ВладелецФормы.Объект.КомиссияЗаДоставку;
	КомиссияЗаОплату	= ВладелецФормы.Объект.КомиссияЗаОплату;
	
	Валюта	= ВладелецФормы.Объект.Валюта;
	ТипЦенСебестоимость	= ВладелецФормы.ТипЦенСебестоимость;
	ВалютаУправленческогоУчета			= ВладелецФормы.ВалютаУправленческогоУчета;
	
	ТипЦенЗакупочный	= ВладелецФормы.Объект.ТипЦенЗакупочный;
	КурсДокумента = ВладелецФормы.Объект.КурсДокумента;
КонецПроцедуры

&НаКлиенте
Процедура КомиссияЗаДоставкуПриИзменении(Элемент)
	
	ВладелецФормы.Объект.КомиссияЗаДоставку = КомиссияЗаДоставку;
	ВладелецФормы.Модифицированность = Истина;
	
	Если ВладелецФормы.Объект.Товары.Количество() Тогда
		ВладелецФормы.ПересчитатьТаблицуТовары();
	КонецЕсли;
	
	ВладелецФормы.ОбновитьОтображениеДанных();

КонецПроцедуры

&НаКлиенте
Процедура КомиссияЗаОплатуПриИзменении(Элемент)
	
	ВладелецФормы.Объект.КомиссияЗаОплату = КомиссияЗаОплату;
	ВладелецФормы.Модифицированность = Истина;
	
	Если ВладелецФормы.Объект.Товары.Количество() Тогда
		ВладелецФормы.ПересчитатьТаблицуТовары();
	КонецЕсли;
	
	ВладелецФормы.ОбновитьОтображениеДанных();

КонецПроцедуры

&НаКлиенте
Процедура ОбщийРасходТранспортировкиПриИзменении(Элемент)
	
	ВладелецФормы.Объект.ОбщийРасходТранспортировки = ОбщийРасходТранспортировки;
	ВладелецФормы.Модифицированность = Истина;
	
	Если ВладелецФормы.Объект.Товары.Количество() Тогда
		ВладелецФормы.ПересчитатьТаблицуТовары();
	КонецЕсли;
	
	ВладелецФормы.ОбновитьОтображениеДанных();

КонецПроцедуры

&НаКлиенте
Процедура ТипЦенЗакупочныйПриИзменении(Элемент)
	
	ВладелецФормы.Объект.ТипЦенЗакупочный = ТипЦенЗакупочный;
	ВладелецФормы.Модифицированность = Истина;
	
	ВладелецФормы.СформироватьВалютныйЗаголовок("ЦенаЗакупочная", ТипЦенЗакупочный);
    ВладелецФормы.СформироватьВалютныйЗаголовок("СебестоимостьЦенаЗакупочная", ТипЦенЗакупочный);
	
	ВладелецФормы.ОбновитьОтображениеДанных();

КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	ВладелецФормы.Объект.Валюта = Валюта;
	ВладелецФормы.Модифицированность = Истина;
	
	ВладелецФормы.ОбновитьОтображениеДанных();

КонецПроцедуры

&НаКлиенте
Процедура ЗагружатьСЦенойПриИзменении(Элемент)
	
	ВладелецФормы.ЗагружатьСЦеной = ЗагружатьСЦеной;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцентТранспортныеРасходыПриИзменении(Элемент)
	
	ВладелецФормы.ПроцентТранспортныеРасходы = ПроцентТранспортныеРасходы;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаНоменклатурыПриИзменении(Элемент)
	
	ВладелецФормы.ГруппировкаНоменклатуры = ГруппировкаНоменклатуры;

КонецПроцедуры

&НаКлиенте
Процедура КурсДокументаПриИзменении(Элемент)
	ВладелецФормы.Объект.КурсДокумента = КурсДокумента;
	ВладелецФормы.Модифицированность = Истина;
	Если  ВладелецФормы.Объект.Себестоимость.Количество() Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Пересчитать таблицу расчета себестоимости?'"), Режим, 0);
	КонецЕсли;
КонецПроцедуры

//...

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    ВладелецФормы.ЗаполнитьТаблицуСебестоимость();
	ВладелецФормы.ОбновитьОтображениеДанных();

КонецПроцедуры 


//&НаКлиенте
//Процедура ТипЦенСебестоимостьПриИзменении(Элемент)
//	
//	ВладелецФормы.Объект.Номер 			= Номер;
//	ВладелецФормы.Модифицированность 	= Истина;
//	
//	ВладелецФормы.ОбновитьОтображениеДанных();

//КонецПроцедуры

//&НаКлиенте
//Процедура ТипЦенМаркетинговаяСебестоимостьПриИзменении(Элемент)
//	
//	ВладелецФормы.Объект.Номер 			= Номер;
//	ВладелецФормы.Модифицированность 	= Истина;
//	
//	ВладелецФормы.ОбновитьОтображениеДанных();

//КонецПроцедуры
